accountsProxy/accountsProxy/src/gateway/duMockTargetServer/apiproxy/resources/node/du-mocks/accounts/GetRequestHistory-Response.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.webservices.com/LCE/Du/WebServices" xmlns:head="http://www.du.ae/LCE/HeaderResponse" xmlns:lcew="http://xmlns.du.ae/LCE/Business/LCEWebServiceResponse" xmlns:get="http://xmlns.du.ae/LCE/Business/RequestManagement/GetRequestHistory">
   <soapenv:Header/>
   <soapenv:Body>
      <web:GetRequestHistoryResponse>
         <Response>
            <head:Header>
               <!--Optional:-->
               <head:RequestId>?</head:RequestId>
               <!--Optional:-->
               <head:CorrelationId>?</head:CorrelationId>
               <head:ResponseCode>?</head:ResponseCode>
               <!--Optional:-->
               <head:ResponseMessage>?</head:ResponseMessage>
               <!--Optional:-->
               <head:ErrorCode>?</head:ErrorCode>
               <!--Optional:-->
               <head:ErrorDescription>?</head:ErrorDescription>
            </head:Header>
            <!--Optional:-->
            <lcew:Body>
               <!--Optional:-->
               <get:ListOfRequests>
                  <!--Zero or more repetitions:-->
                  <get:Requests>
                     <get:RequestID>?</get:RequestID>
                     <get:SubmissionDate>?</get:SubmissionDate>
                     <get:ExecutionDate>?</get:ExecutionDate>
                     <get:ActionDescription>?</get:ActionDescription>
                     <get:ActionShortCode>?</get:ActionShortCode>
                     <get:Status>?</get:Status>
                     <!--Optional:-->
                     <get:ReqUser>?</get:ReqUser>
                     <!--Optional:-->
                     <get:Channel>?</get:Channel>
                     <!--Optional:-->
                     <get:Target>?</get:Target>
                     <get:OrderCancellableFlag>?</get:OrderCancellableFlag>
                     <!--Optional:-->
                     <get:RequestType>?</get:RequestType>
                     <!--Optional:-->
                     <get:ServiceType>?</get:ServiceType>
                     <!--Optional:-->
                     <get:ContractID>?</get:ContractID>
                  </get:Requests>
               </get:ListOfRequests>
            </lcew:Body>
         </Response>
      </web:GetRequestHistoryResponse>
   </soapenv:Body>
</soapenv:Envelope>